       IDENTIFICATION DIVISION.
       PROGRAM-ID. MOD_SPACE.
       DATA DIVISION.
       PROCEDURE DIVISION.
           DISPLAY " " WITH NO ADVANCING
           END-DISPLAY
           GOBACK.
       END PROGRAM MOD_SPACE.
       IDENTIFICATION DIVISION.
       PROGRAM-ID. MOD_SPACE_INIT.
       DATA DIVISION.
       PROCEDURE DIVISION.
           SET RETURN-CODE TO 1.
           GOBACK.
       END PROGRAM MOD_SPACE_INIT.
