       IDENTIFICATION DIVISION.
       PROGRAM-ID. MOD_TEXT.
       DATA DIVISION.
       LINKAGE SECTION.
       01 L-DATA                       PICTURE IS X(42).
       PROCEDURE DIVISION USING BY REFERENCE L-DATA.
           DISPLAY FUNCTION TRIM(L-DATA) WITH NO ADVANCING
           END-DISPLAY
           GOBACK.
       END PROGRAM MOD_TEXT.
       IDENTIFICATION DIVISION.
       PROGRAM-ID. MOD_TEXT_INIT.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 L-BODY              EXTERNAL PICTURE IS X(42).
       LINKAGE SECTION.
       01 L-DATA                       PICTURE IS X(42).
       PROCEDURE DIVISION USING BY REFERENCE L-DATA.
           MOVE L-BODY                 TO L-DATA
           SET RETURN-CODE             TO 2
           GOBACK.
       END PROGRAM MOD_TEXT_INIT.
