       01 THEMES-LEN                   PIC IS 99 VALUE IS 00.
       01 WS-THEMES OCCURS 10 TIMES INDEXED BY THM-IDX.
           05 WS-THEMES-BG-PRIMARY     PIC XXXXXXXXX.
           05 WS-THEMES-FG-PRIMARY     PIC XXXXXXXXX.
           05 WS-THEMES-BG-SECONDARY   PIC XXXXXXXXX.
           05 WS-THEMES-FG-SECONDARY   PIC XXXXXXXXX.
           05 WS-THEMES-BG-TERNARY     PIC XXXXXXXXX.
           05 WS-THEMES-FG-TERNARY     PIC XXXXXXXXX.
           05 WS-THEMES-BLACK-BG       PIC XXXXXXXXX.
           05 WS-THEMES-BLACK-FG       PIC XXXXXXXXX.
           05 WS-THEMES-WHITE-BG       PIC XXXXXXXXX.
           05 WS-THEMES-WHITE-FG       PIC XXXXXXXXX.
           05 WS-THEMES-CIRNO-BG       PIC XXXXXXXXX.
           05 WS-THEMES-CIRNO-FG       PIC XXXXXXXXX.
           05 WS-THEMES-LOVE-BG        PIC XXXXXXXXX.
           05 WS-THEMES-LOVE-FG        PIC XXXXXXXXX.
           05 WS-THEMES-GOLD-BG        PIC XXXXXXXXX.
           05 WS-THEMES-GOLD-FG        PIC XXXXXXXXX.
           05 WS-THEMES-ROSE-BG        PIC XXXXXXXXX.
           05 WS-THEMES-ROSE-FG        PIC XXXXXXXXX.
           05 WS-THEMES-PINE-BG        PIC XXXXXXXXX.
           05 WS-THEMES-PINE-FG        PIC XXXXXXXXX.
           05 WS-THEMES-FOAM-BG        PIC XXXXXXXXX.
           05 WS-THEMES-FOAM-FG        PIC XXXXXXXXX.
           05 WS-THEMES-IRIS-BG        PIC XXXXXXXXX.
           05 WS-THEMES-IRIS-FG        PIC XXXXXXXXX.
