       IDENTIFICATION DIVISION.
       PROGRAM-ID. DDATEHOOK.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-CURRENT-DATE-FIELDS.
        05  WS-CURRENT-DATE.
           10  FILLER             PIC  9(2).
           10  WS-CURRENT-YEAR    PIC  9(2).
           10  WS-CURRENT-MONTH   PIC  9(2).
           10  WS-CURRENT-DAY     PIC  9(2).
        05  WS-CURRENT-TIME.
           10  WS-CURRENT-HOUR    PIC  9(2).
           10  WS-CURRENT-MINUTE  PIC  9(2).
           10  WS-CURRENT-SECOND  PIC  9(2).
           10  WS-CURRENT-MS      PIC  9(2).
        05  WS-DIFF-FROM-GMT      PIC S9(4).
       LINKAGE SECTION.
       01 L-BODY                  PIC X(71).
       PROCEDURE DIVISION USING L-BODY.
           MOVE FUNCTION CURRENT-DATE TO WS-CURRENT-DATE-FIELDS
           DISPLAY WS-CURRENT-DAY, "/" WITH NO ADVANCING
           DISPLAY WS-CURRENT-MONTH, "/" WITH NO ADVANCING
           EVALUATE L-BODY
               WHEN "Y2K"   DISPLAY "19" WITH NO ADVANCING
               WHEN "Y2.1K" DISPLAY "20" WITH NO ADVANCING
               WHEN "Y2.2K" DISPLAY "21" WITH NO ADVANCING
               WHEN OTHER CONTINUE
           END-EVALUATE
           DISPLAY WS-CURRENT-YEAR  WITH NO ADVANCING
           GOBACK.
