       IDENTIFICATION DIVISION.
       PROGRAM-ID. DDATE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-CALLBACK PROCEDURE-POINTER.
       PROCEDURE DIVISION.
           SET WS-CALLBACK TO ENTRY 'DDATEHOOK'.
           CALL
               'OUTPUT_FMT' USING
               0 WS-CALLBACK "ffffff"
           END-CALL
           GOBACK.
