       IDENTIFICATION DIVISION.
       PROGRAM-ID. DSPACEHOOK.
       DATA DIVISION.
       PROCEDURE DIVISION.
           DISPLAY " " WITH NO ADVANCING
           END-DISPLAY
           GOBACK.

