       IDENTIFICATION DIVISION.
       PROGRAM-ID. STATLN03.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       LINKAGE SECTION.
       01 L-BODY PICTURE IS X(72).
       PROCEDURE DIVISION USING L-BODY.
           GOBACK.
