       IDENTIFICATION DIVISION.
       PROGRAM-ID. DSYSHOOK.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       LINKAGE SECTION.
       01 L-BODY                  PIC X(71).
       PROCEDURE DIVISION USING L-BODY.
           CALL 'SYSTEM' USING L-BODY.
           GOBACK.
