       IDENTIFICATION DIVISION.
       PROGRAM-ID. DTEXTHOOK.
       DATA DIVISION.
       LINKAGE SECTION.
       01 L-BODY                  PIC X(71).
       PROCEDURE DIVISION USING L-BODY.
           DISPLAY FUNCTION TRIM(L-BODY) WITH NO ADVANCING
           GOBACK.

