
       01 THEMES-LEN                   PIC IS 99 VALUE IS 00.
       01 WS-THEMES OCCURS 10 TIMES INDEXED BY THM-IDX.
           05 WS-THEMES-BG-PRIMARY     PIC XXXXXXXX.
           05 WS-THEMES-FG-PRIMARY     PIC XXXXXXXX.
           05 WS-THEMES-BG-SECONDARY   PIC XXXXXXXX.
           05 WS-THEMES-FG-SECONDARY   PIC XXXXXXXX.
           05 WS-THEMES-BG-TERNARY     PIC XXXXXXXX.
           05 WS-THEMES-FG-TERNARY     PIC XXXXXXXX.
           05 WS-THEMES-BLACK-BG       PIC XXXXXXXX.
           05 WS-THEMES-BLACK-FG       PIC XXXXXXXX.
           05 WS-THEMES-WHITE-BG       PIC XXXXXXXX.
           05 WS-THEMES-WHITE-FG       PIC XXXXXXXX.
           05 WS-THEMES-CIRNO-BG       PIC XXXXXXXX.
           05 WS-THEMES-CIRNO-FG       PIC XXXXXXXX.
           05 WS-THEMES-LOVE-BG        PIC XXXXXXXX.
           05 WS-THEMES-LOVE-FG        PIC XXXXXXXX.
           05 WS-THEMES-GOLD-BG        PIC XXXXXXXX.
           05 WS-THEMES-GOLD-FG        PIC XXXXXXXX.
           05 WS-THEMES-ROSE-BG        PIC XXXXXXXX.
           05 WS-THEMES-ROSE-FG        PIC XXXXXXXX.
           05 WS-THEMES-PINE-BG        PIC XXXXXXXX.
           05 WS-THEMES-PINE-FG        PIC XXXXXXXX.
           05 WS-THEMES-FOAM-BG        PIC XXXXXXXX.
           05 WS-THEMES-FOAM-FG        PIC XXXXXXXX.
           05 WS-THEMES-IRIS-BG        PIC XXXXXXXX.
           05 WS-THEMES-IRIS-FG        PIC XXXXXXXX.
