       IDENTIFICATION DIVISION.
       PROGRAM-ID. DTIME.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-CALLBACK PROCEDURE-POINTER.
       PROCEDURE DIVISION.
           SET WS-CALLBACK TO ENTRY 'DTIMEHOOK'.
           CALL
               'OUTPUT_FMT' USING
               0 WS-CALLBACK "f00000"
           END-CALL
           GOBACK.
